; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  ) 

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem_d1_r0_l35_p35_c35_g35)
  (:domain emergency-services)
  (:objects
    drone1 - drone
    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location
    loc7 - location
    loc8 - location
    loc9 - location
    loc10 - location
    loc11 - location
    loc12 - location
    loc13 - location
    loc14 - location
    loc15 - location
    loc16 - location
    loc17 - location
    loc18 - location
    loc19 - location
    loc20 - location
    loc21 - location
    loc22 - location
    loc23 - location
    loc24 - location
    loc25 - location
    loc26 - location
    loc27 - location
    loc28 - location
    loc29 - location
    loc30 - location
    loc31 - location
    loc32 - location
    loc33 - location
    loc34 - location
    loc35 - location
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person
    person7 - person
    person8 - person
    person9 - person
    person10 - person
    person11 - person
    person12 - person
    person13 - person
    person14 - person
    person15 - person
    person16 - person
    person17 - person
    person18 - person
    person19 - person
    person20 - person
    person21 - person
    person22 - person
    person23 - person
    person24 - person
    person25 - person
    person26 - person
    person27 - person
    person28 - person
    person29 - person
    person30 - person
    person31 - person
    person32 - person
    person33 - person
    person34 - person
    person35 - person
    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    crate6 - crate
    crate7 - crate
    crate8 - crate
    crate9 - crate
    crate10 - crate
    crate11 - crate
    crate12 - crate
    crate13 - crate
    crate14 - crate
    crate15 - crate
    crate16 - crate
    crate17 - crate
    crate18 - crate
    crate19 - crate
    crate20 - crate
    crate21 - crate
    crate22 - crate
    crate23 - crate
    crate24 - crate
    crate25 - crate
    crate26 - crate
    crate27 - crate
    crate28 - crate
    crate29 - crate
    crate30 - crate
    crate31 - crate
    crate32 - crate
    crate33 - crate
    crate34 - crate
    crate35 - crate
    food - content
    medicine - content
    left - arm
    right - arm
  )
  (:init
    (at-drone drone1 depot)
    (hand-empty drone1 left)
    (hand-empty drone1 right)
    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-crate crate6 depot)
    (at-crate crate7 depot)
    (at-crate crate8 depot)
    (at-crate crate9 depot)
    (at-crate crate10 depot)
    (at-crate crate11 depot)
    (at-crate crate12 depot)
    (at-crate crate13 depot)
    (at-crate crate14 depot)
    (at-crate crate15 depot)
    (at-crate crate16 depot)
    (at-crate crate17 depot)
    (at-crate crate18 depot)
    (at-crate crate19 depot)
    (at-crate crate20 depot)
    (at-crate crate21 depot)
    (at-crate crate22 depot)
    (at-crate crate23 depot)
    (at-crate crate24 depot)
    (at-crate crate25 depot)
    (at-crate crate26 depot)
    (at-crate crate27 depot)
    (at-crate crate28 depot)
    (at-crate crate29 depot)
    (at-crate crate30 depot)
    (at-crate crate31 depot)
    (at-crate crate32 depot)
    (at-crate crate33 depot)
    (at-crate crate34 depot)
    (at-crate crate35 depot)
    (at-person person1 loc27)
    (at-person person2 loc5)
    (at-person person3 loc12)
    (at-person person4 loc24)
    (at-person person5 loc26)
    (at-person person6 loc28)
    (at-person person7 loc1)
    (at-person person8 loc2)
    (at-person person9 loc24)
    (at-person person10 loc27)
    (at-person person11 loc26)
    (at-person person12 loc7)
    (at-person person13 loc17)
    (at-person person14 loc32)
    (at-person person15 loc17)
    (at-person person16 loc20)
    (at-person person17 loc19)
    (at-person person18 loc2)
    (at-person person19 loc24)
    (at-person person20 loc33)
    (at-person person21 loc34)
    (at-person person22 loc33)
    (at-person person23 loc20)
    (at-person person24 loc16)
    (at-person person25 loc26)
    (at-person person26 loc21)
    (at-person person27 loc22)
    (at-person person28 loc30)
    (at-person person29 loc24)
    (at-person person30 loc4)
    (at-person person31 loc15)
    (at-person person32 loc4)
    (at-person person33 loc7)
    (at-person person34 loc30)
    (at-person person35 loc11)
    (crate-content crate1 food)
    (crate-content crate2 food)
    (crate-content crate3 food)
    (crate-content crate4 food)
    (crate-content crate5 food)
    (crate-content crate6 food)
    (crate-content crate7 food)
    (crate-content crate8 food)
    (crate-content crate9 food)
    (crate-content crate10 food)
    (crate-content crate11 food)
    (crate-content crate12 food)
    (crate-content crate13 food)
    (crate-content crate14 food)
    (crate-content crate15 food)
    (crate-content crate16 food)
    (crate-content crate17 food)
    (crate-content crate18 food)
    (crate-content crate19 food)
    (crate-content crate20 food)
    (crate-content crate21 food)
    (crate-content crate22 food)
    (crate-content crate23 food)
    (crate-content crate24 food)
    (crate-content crate25 food)
    (crate-content crate26 food)
    (crate-content crate27 food)
    (crate-content crate28 food)
    (crate-content crate29 food)
    (crate-content crate30 food)
    (crate-content crate31 food)
    (crate-content crate32 medicine)
    (crate-content crate33 medicine)
    (crate-content crate34 medicine)
    (crate-content crate35 medicine)
  )
  (:goal (and
    (has-content person1 food)
    (has-content person3 food)
    (has-content person4 food)
    (has-content person5 food)
    (has-content person5 medicine)
    (has-content person6 food)
    (has-content person7 food)
    (has-content person8 food)
    (has-content person9 food)
    (has-content person10 food)
    (has-content person11 food)
    (has-content person12 food)
    (has-content person13 food)
    (has-content person14 food)
    (has-content person15 food)
    (has-content person15 medicine)
    (has-content person16 food)
    (has-content person17 food)
    (has-content person18 food)
    (has-content person19 food)
    (has-content person20 food)
    (has-content person21 food)
    (has-content person22 food)
    (has-content person24 food)
    (has-content person25 food)
    (has-content person25 medicine)
    (has-content person26 food)
    (has-content person27 food)
    (has-content person28 food)
    (has-content person29 food)
    (has-content person30 food)
    (has-content person32 food)
    (has-content person33 food)
    (has-content person34 food)
    (has-content person35 medicine)
  ))
)

; plan
1. (pick-up drone1 right crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate1)
   goals met: 0 of 35
2. (pick-up drone1 left crate32 depot)
   deleted: (at-crate crate32 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate32)
   goals met: 0 of 35
3. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 0 of 35
4. (deliver drone1 right crate1 person3 loc12 food)
   deleted: (holding drone1 right crate1)
   added: (hand-empty drone1 right) (has-content person3 food)
   goals met: 1 of 35
5. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 1 of 35
6. (pick-up drone1 right crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate2)
   goals met: 1 of 35
7. (fly drone1 depot loc28)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc28)
   goals met: 1 of 35
8. (deliver drone1 right crate2 person6 loc28 food)
   deleted: (holding drone1 right crate2)
   added: (hand-empty drone1 right) (has-content person6 food)
   goals met: 2 of 35
9. (fly drone1 loc28 depot)
   deleted: (at-drone drone1 loc28)
   added: (at-drone drone1 depot)
   goals met: 2 of 35
10. (pick-up drone1 right crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate3)
   goals met: 2 of 35
11. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 2 of 35
12. (deliver drone1 right crate3 person7 loc1 food)
   deleted: (holding drone1 right crate3)
   added: (hand-empty drone1 right) (has-content person7 food)
   goals met: 3 of 35
13. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 3 of 35
14. (pick-up drone1 right crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate4)
   goals met: 3 of 35
15. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 3 of 35
16. (fly drone1 loc27 loc32)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 loc32)
   goals met: 3 of 35
17. (deliver drone1 right crate4 person14 loc32 food)
   deleted: (holding drone1 right crate4)
   added: (hand-empty drone1 right) (has-content person14 food)
   goals met: 4 of 35
18. (fly drone1 loc32 depot)
   deleted: (at-drone drone1 loc32)
   added: (at-drone drone1 depot)
   goals met: 4 of 35
19. (pick-up drone1 right crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate5)
   goals met: 4 of 35
20. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 4 of 35
21. (fly drone1 loc27 loc20)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 loc20)
   goals met: 4 of 35
22. (deliver drone1 right crate5 person16 loc20 food)
   deleted: (holding drone1 right crate5)
   added: (hand-empty drone1 right) (has-content person16 food)
   goals met: 5 of 35
23. (fly drone1 loc20 depot)
   deleted: (at-drone drone1 loc20)
   added: (at-drone drone1 depot)
   goals met: 5 of 35
24. (pick-up drone1 right crate6 depot)
   deleted: (at-crate crate6 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate6)
   goals met: 5 of 35
25. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 5 of 35
26. (fly drone1 loc27 loc19)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 loc19)
   goals met: 5 of 35
27. (deliver drone1 right crate6 person17 loc19 food)
   deleted: (holding drone1 right crate6)
   added: (hand-empty drone1 right) (has-content person17 food)
   goals met: 6 of 35
28. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 6 of 35
29. (pick-up drone1 right crate7 depot)
   deleted: (at-crate crate7 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate7)
   goals met: 6 of 35
30. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 6 of 35
31. (fly drone1 loc27 loc34)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 loc34)
   goals met: 6 of 35
32. (deliver drone1 right crate7 person21 loc34 food)
   deleted: (holding drone1 right crate7)
   added: (hand-empty drone1 right) (has-content person21 food)
   goals met: 7 of 35
33. (fly drone1 loc34 depot)
   deleted: (at-drone drone1 loc34)
   added: (at-drone drone1 depot)
   goals met: 7 of 35
34. (pick-up drone1 right crate8 depot)
   deleted: (at-crate crate8 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate8)
   goals met: 7 of 35
35. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 7 of 35
36. (fly drone1 loc27 loc16)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 loc16)
   goals met: 7 of 35
37. (deliver drone1 right crate8 person24 loc16 food)
   deleted: (holding drone1 right crate8)
   added: (hand-empty drone1 right) (has-content person24 food)
   goals met: 8 of 35
38. (fly drone1 loc16 depot)
   deleted: (at-drone drone1 loc16)
   added: (at-drone drone1 depot)
   goals met: 8 of 35
39. (pick-up drone1 right crate9 depot)
   deleted: (at-crate crate9 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate9)
   goals met: 8 of 35
40. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 8 of 35
41. (fly drone1 loc27 loc21)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 loc21)
   goals met: 8 of 35
42. (deliver drone1 right crate9 person26 loc21 food)
   deleted: (holding drone1 right crate9)
   added: (hand-empty drone1 right) (has-content person26 food)
   goals met: 9 of 35
43. (fly drone1 loc21 depot)
   deleted: (at-drone drone1 loc21)
   added: (at-drone drone1 depot)
   goals met: 9 of 35
44. (pick-up drone1 right crate10 depot)
   deleted: (at-crate crate10 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate10)
   goals met: 9 of 35
45. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 9 of 35
46. (fly drone1 loc27 loc22)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 loc22)
   goals met: 9 of 35
47. (deliver drone1 right crate10 person27 loc22 food)
   deleted: (holding drone1 right crate10)
   added: (hand-empty drone1 right) (has-content person27 food)
   goals met: 10 of 35
48. (fly drone1 loc22 depot)
   deleted: (at-drone drone1 loc22)
   added: (at-drone drone1 depot)
   goals met: 10 of 35
49. (pick-up drone1 right crate11 depot)
   deleted: (at-crate crate11 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate11)
   goals met: 10 of 35
50. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 10 of 35
51. (fly drone1 loc27 loc11)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 loc11)
   goals met: 10 of 35
52. (deliver drone1 left crate32 person35 loc11 medicine)
   deleted: (holding drone1 left crate32)
   added: (hand-empty drone1 left) (has-content person35 medicine)
   goals met: 11 of 35
53. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 11 of 35
54. (pick-up drone1 left crate33 depot)
   deleted: (at-crate crate33 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate33)
   goals met: 11 of 35
55. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 11 of 35
56. (deliver drone1 right crate11 person1 loc27 food)
   deleted: (holding drone1 right crate11)
   added: (hand-empty drone1 right) (has-content person1 food)
   goals met: 12 of 35
57. (fly drone1 loc27 depot)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 depot)
   goals met: 12 of 35
58. (pick-up drone1 right crate12 depot)
   deleted: (at-crate crate12 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate12)
   goals met: 12 of 35
59. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 12 of 35
60. (deliver drone1 right crate12 person10 loc27 food)
   deleted: (holding drone1 right crate12)
   added: (hand-empty drone1 right) (has-content person10 food)
   goals met: 13 of 35
61. (fly drone1 loc27 depot)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 depot)
   goals met: 13 of 35
62. (pick-up drone1 right crate13 depot)
   deleted: (at-crate crate13 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate13)
   goals met: 13 of 35
63. (fly drone1 depot loc17)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc17)
   goals met: 13 of 35
64. (deliver drone1 right crate13 person13 loc17 food)
   deleted: (holding drone1 right crate13)
   added: (hand-empty drone1 right) (has-content person13 food)
   goals met: 14 of 35
65. (fly drone1 loc17 depot)
   deleted: (at-drone drone1 loc17)
   added: (at-drone drone1 depot)
   goals met: 14 of 35
66. (pick-up drone1 right crate14 depot)
   deleted: (at-crate crate14 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate14)
   goals met: 14 of 35
67. (fly drone1 depot loc17)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc17)
   goals met: 14 of 35
68. (deliver drone1 right crate14 person15 loc17 food)
   deleted: (holding drone1 right crate14)
   added: (hand-empty drone1 right) (has-content person15 food)
   goals met: 15 of 35
69. (fly drone1 loc17 depot)
   deleted: (at-drone drone1 loc17)
   added: (at-drone drone1 depot)
   goals met: 15 of 35
70. (pick-up drone1 right crate15 depot)
   deleted: (at-crate crate15 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate15)
   goals met: 15 of 35
71. (fly drone1 depot loc17)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc17)
   goals met: 15 of 35
72. (deliver drone1 left crate33 person15 loc17 medicine)
   deleted: (holding drone1 left crate33)
   added: (hand-empty drone1 left) (has-content person15 medicine)
   goals met: 16 of 35
73. (fly drone1 loc17 depot)
   deleted: (at-drone drone1 loc17)
   added: (at-drone drone1 depot)
   goals met: 16 of 35
74. (pick-up drone1 left crate34 depot)
   deleted: (at-crate crate34 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate34)
   goals met: 16 of 35
75. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 16 of 35
76. (deliver drone1 right crate15 person8 loc2 food)
   deleted: (holding drone1 right crate15)
   added: (hand-empty drone1 right) (has-content person8 food)
   goals met: 17 of 35
77. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 17 of 35
78. (pick-up drone1 right crate16 depot)
   deleted: (at-crate crate16 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate16)
   goals met: 17 of 35
79. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 17 of 35
80. (deliver drone1 right crate16 person18 loc2 food)
   deleted: (holding drone1 right crate16)
   added: (hand-empty drone1 right) (has-content person18 food)
   goals met: 18 of 35
81. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 18 of 35
82. (pick-up drone1 right crate17 depot)
   deleted: (at-crate crate17 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate17)
   goals met: 18 of 35
83. (fly drone1 depot loc33)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc33)
   goals met: 18 of 35
84. (deliver drone1 right crate17 person20 loc33 food)
   deleted: (holding drone1 right crate17)
   added: (hand-empty drone1 right) (has-content person20 food)
   goals met: 19 of 35
85. (fly drone1 loc33 depot)
   deleted: (at-drone drone1 loc33)
   added: (at-drone drone1 depot)
   goals met: 19 of 35
86. (pick-up drone1 right crate18 depot)
   deleted: (at-crate crate18 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate18)
   goals met: 19 of 35
87. (fly drone1 depot loc33)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc33)
   goals met: 19 of 35
88. (deliver drone1 right crate18 person22 loc33 food)
   deleted: (holding drone1 right crate18)
   added: (hand-empty drone1 right) (has-content person22 food)
   goals met: 20 of 35
89. (fly drone1 loc33 depot)
   deleted: (at-drone drone1 loc33)
   added: (at-drone drone1 depot)
   goals met: 20 of 35
90. (pick-up drone1 right crate19 depot)
   deleted: (at-crate crate19 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate19)
   goals met: 20 of 35
91. (fly drone1 depot loc26)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc26)
   goals met: 20 of 35
92. (deliver drone1 right crate19 person5 loc26 food)
   deleted: (holding drone1 right crate19)
   added: (hand-empty drone1 right) (has-content person5 food)
   goals met: 21 of 35
93. (fly drone1 loc26 depot)
   deleted: (at-drone drone1 loc26)
   added: (at-drone drone1 depot)
   goals met: 21 of 35
94. (pick-up drone1 right crate20 depot)
   deleted: (at-crate crate20 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate20)
   goals met: 21 of 35
95. (fly drone1 depot loc26)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc26)
   goals met: 21 of 35
96. (deliver drone1 left crate34 person5 loc26 medicine)
   deleted: (holding drone1 left crate34)
   added: (hand-empty drone1 left) (has-content person5 medicine)
   goals met: 22 of 35
97. (fly drone1 loc26 depot)
   deleted: (at-drone drone1 loc26)
   added: (at-drone drone1 depot)
   goals met: 22 of 35
98. (pick-up drone1 left crate35 depot)
   deleted: (at-crate crate35 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate35)
   goals met: 22 of 35
99. (fly drone1 depot loc26)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc26)
   goals met: 22 of 35
100. (deliver drone1 left crate35 person25 loc26 medicine)
   deleted: (holding drone1 left crate35)
   added: (hand-empty drone1 left) (has-content person25 medicine)
   goals met: 23 of 35
101. (deliver drone1 right crate20 person11 loc26 food)
   deleted: (holding drone1 right crate20)
   added: (hand-empty drone1 right) (has-content person11 food)
   goals met: 24 of 35
102. (fly drone1 loc26 depot)
   deleted: (at-drone drone1 loc26)
   added: (at-drone drone1 depot)
   goals met: 24 of 35
103. (pick-up drone1 right crate21 depot)
   deleted: (at-crate crate21 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate21)
   goals met: 24 of 35
104. (fly drone1 depot loc26)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc26)
   goals met: 24 of 35
105. (deliver drone1 right crate21 person25 loc26 food)
   deleted: (holding drone1 right crate21)
   added: (hand-empty drone1 right) (has-content person25 food)
   goals met: 25 of 35
106. (fly drone1 loc26 depot)
   deleted: (at-drone drone1 loc26)
   added: (at-drone drone1 depot)
   goals met: 25 of 35
107. (pick-up drone1 right crate22 depot)
   deleted: (at-crate crate22 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate22)
   goals met: 25 of 35
108. (fly drone1 depot loc24)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc24)
   goals met: 25 of 35
109. (deliver drone1 right crate22 person4 loc24 food)
   deleted: (holding drone1 right crate22)
   added: (hand-empty drone1 right) (has-content person4 food)
   goals met: 26 of 35
110. (fly drone1 loc24 depot)
   deleted: (at-drone drone1 loc24)
   added: (at-drone drone1 depot)
   goals met: 26 of 35
111. (pick-up drone1 right crate23 depot)
   deleted: (at-crate crate23 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate23)
   goals met: 26 of 35
112. (fly drone1 depot loc24)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc24)
   goals met: 26 of 35
113. (deliver drone1 right crate23 person9 loc24 food)
   deleted: (holding drone1 right crate23)
   added: (hand-empty drone1 right) (has-content person9 food)
   goals met: 27 of 35
114. (fly drone1 loc24 depot)
   deleted: (at-drone drone1 loc24)
   added: (at-drone drone1 depot)
   goals met: 27 of 35
115. (pick-up drone1 right crate24 depot)
   deleted: (at-crate crate24 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate24)
   goals met: 27 of 35
116. (fly drone1 depot loc24)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc24)
   goals met: 27 of 35
117. (deliver drone1 right crate24 person19 loc24 food)
   deleted: (holding drone1 right crate24)
   added: (hand-empty drone1 right) (has-content person19 food)
   goals met: 28 of 35
118. (fly drone1 loc24 depot)
   deleted: (at-drone drone1 loc24)
   added: (at-drone drone1 depot)
   goals met: 28 of 35
119. (pick-up drone1 right crate25 depot)
   deleted: (at-crate crate25 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate25)
   goals met: 28 of 35
120. (fly drone1 depot loc24)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc24)
   goals met: 28 of 35
121. (deliver drone1 right crate25 person29 loc24 food)
   deleted: (holding drone1 right crate25)
   added: (hand-empty drone1 right) (has-content person29 food)
   goals met: 29 of 35
122. (fly drone1 loc24 depot)
   deleted: (at-drone drone1 loc24)
   added: (at-drone drone1 depot)
   goals met: 29 of 35
123. (pick-up drone1 right crate26 depot)
   deleted: (at-crate crate26 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate26)
   goals met: 29 of 35
124. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 29 of 35
125. (deliver drone1 right crate26 person30 loc4 food)
   deleted: (holding drone1 right crate26)
   added: (hand-empty drone1 right) (has-content person30 food)
   goals met: 30 of 35
126. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 30 of 35
127. (pick-up drone1 right crate27 depot)
   deleted: (at-crate crate27 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate27)
   goals met: 30 of 35
128. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 30 of 35
129. (deliver drone1 right crate27 person32 loc4 food)
   deleted: (holding drone1 right crate27)
   added: (hand-empty drone1 right) (has-content person32 food)
   goals met: 31 of 35
130. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 31 of 35
131. (pick-up drone1 right crate28 depot)
   deleted: (at-crate crate28 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate28)
   goals met: 31 of 35
132. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 31 of 35
133. (deliver drone1 right crate28 person12 loc7 food)
   deleted: (holding drone1 right crate28)
   added: (hand-empty drone1 right) (has-content person12 food)
   goals met: 32 of 35
134. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 32 of 35
135. (pick-up drone1 right crate29 depot)
   deleted: (at-crate crate29 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate29)
   goals met: 32 of 35
136. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 32 of 35
137. (deliver drone1 right crate29 person33 loc7 food)
   deleted: (holding drone1 right crate29)
   added: (hand-empty drone1 right) (has-content person33 food)
   goals met: 33 of 35
138. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 33 of 35
139. (pick-up drone1 right crate30 depot)
   deleted: (at-crate crate30 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate30)
   goals met: 33 of 35
140. (fly drone1 depot loc30)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc30)
   goals met: 33 of 35
141. (deliver drone1 right crate30 person28 loc30 food)
   deleted: (holding drone1 right crate30)
   added: (hand-empty drone1 right) (has-content person28 food)
   goals met: 34 of 35
142. (fly drone1 loc30 depot)
   deleted: (at-drone drone1 loc30)
   added: (at-drone drone1 depot)
   goals met: 34 of 35
143. (pick-up drone1 right crate31 depot)
   deleted: (at-crate crate31 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate31)
   goals met: 34 of 35
144. (fly drone1 depot loc30)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc30)
   goals met: 34 of 35
145. (deliver drone1 right crate31 person34 loc30 food)
   deleted: (holding drone1 right crate31)
   added: (hand-empty drone1 right) (has-content person34 food)
   goals met: 35 of 35
